/*
  Фибоначчи
  Классическая задача, которую можно встретить на собеседованиях самого разного уровня.
  Стоит напомнить, что последовательность Фибоначчи — это ряд чисел, где каждое последующее является суммой двух предыдущих.
  Так, первые десять чисел выглядят следующим образом: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34.

  Постановка
  Нужно написать функцию, которая возвращает n-ную запись в определенной последовательности,
  причем n — число, которое передается в качестве аргумента функции.
*/

const fibonacci = num => {
  return 0
}

console.log(fibonacci(3)) // --> 2
console.log(fibonacci(4)) // --> 3
